tutorials/steelBallRun-pimple/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     freeFallingPimpleFoam;

startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         15;       // 0.5 s → ball has fallen ~1.2 m, speed ~5 m/s

deltaT          1e-4;      // initial time step; adjusted by adjustTimeStep

writeControl    adjustableRunTime;
writeInterval   0.01;      // write every 10 ms (50 frames total)

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.5;       // Courant number limit


libs
(
    libfallingInletVelocity
);

functions
{
    forces
    {
        type            forces;
        libs            ( forces );
        writeControl    timeStep;
        writeInterval   10;

        patches         ( sphere );
        rho             rhoInf;
        rhoInf          1.2;        // air density [kg/m³]

        CofR            ( 0  0.24  0 );  // sphere centre (matches blockMeshDict)

        log             yes;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            ( forces );
        writeControl    timeStep;
        writeInterval   10;

        patches         ( sphere );
        rho             rhoInf;
        rhoInf          1.2;

        liftDir         ( 1  0  0 );   // radial
        dragDir         ( 0 -1  0 );   // downward (direction of fall)
        pitchAxis       ( 0  0  1 );

        magUInf         1.0;           // updated at run-time by the BC;
                                       // set to 1 to get dimensional Cd*A
        lRef            0.04;          // sphere diameter [m]
        Aref            1.2566e-3;

        CofR            ( 0  0.24  0 );
        log             yes;
    }
}

// ************************************************************************* //
